app/views/page/_issue_list.html.erb

SELECT COUNT(*) FROM `comments`  WHERE `comments`.`issue_id` = 7
---

        <%= link_to i.comments.count, i %>