app/controllers/comments_controller.rb

	def create
		# c = Comment.new
		# c.username = params[:username]
		# c.email = params[:email]
		# c.content = params[:content]
		# c.issue_id = params[:issue_id]
		# c.save

		c = Comment.new(comment_params)
		c.save
---
INSERT INTO `comments` (`content`, `created_at`, `email`, `issue_id`, `updated_at`, `username`) VALUES ('bb', '2015-04-02 06:21:56', '', 7, '2015-04-02 06:21:56', 'aa')