app/controllers/issues_controller.rb

SELECT  `issues`.* FROM `issues`  WHERE `issues`.`id` = 1 LIMIT 1
---
  def show
    #[Kieth] 调试语句
  	#render plain: params[:id].inspect

  	@issue = Issue.find(params[:id])

INSERT INTO `issues` (`content`, `created_at`, `title`, `updated_at`) VALUES ('bbb', '2015-04-01 10:07:24', 'a', '2015-04-01 10:07:24')
---
 def create
    #render plain: params[:issue].inspect
    Issue.create(issue_params)

SELECT  `issues`.* FROM `issues`  WHERE `issues`.`id` = 2 LIMIT 1
---
  def edit
    @issue = Issue.find(params[:id])

SELECT  `issues`.* FROM `issues`  WHERE `issues`.`id` = 2 LIMIT 1
UPDATE `issues` SET `content` = 'keith add 2 adfadsfas', `updated_at` = '2015-04-01 10:22:00' WHERE `issues`.`id` = 2
---
  def update
    i = Issue.find(params[:id])
    i.update_attributes(issue_params)

SELECT  `issues`.* FROM `issues`  WHERE `issues`.`id` = 1 LIMIT 1
DELETE FROM `issues` WHERE `issues`.`id` = 1
---
  def destroy
  	i = Issue.find(params[:id])
  	i.destroy