app/controllers/page_controller.rb

	def welcome
		@issues  = Issue.all.reverse
---
SELECT `issues`.* FROM `issues`